import { useState } from 'react';
import './App.css';
import Header from './components/Header/Header.jsx'
// import MainContent from './components/MainContent/MainContent.jsx'
// import Footer from './components/Footer/Footer.jsx'

function App() {
  // хранение состояния текущей темы сайта
  const [theme,setTheme] = useState('light');
  
  // useState('light') - деструктуризация
  // ('light') ()- это аргумент внутри
  // const arr = ['light', (state) => {theme = newstate}] //same same
  // setTheme('dark') - это ф-я
  // theme -переменная

  // ф-я для переключ-я темы
  const toggleTheme = () => {
    setTheme((prevTheme) => {
      return prevTheme === 'light' ? 'dark': 'light';
    })
  }

  return(
    <div className={`app ${theme}`}>
      <Header theme = {theme} toggleTheme={toggleTheme}/>
      {/* <MainContent theme = {theme}/>
      <Footer theme = {theme}/> */}
    </div>
  )

}
export default App;



// Создание приложения с переключением темы на сайте:
// 1.Создайте новый React-проект с помощью create-react-app. Подготовьте проект к работе.
// 2.Разделите интерфейс на три основных компонента: Header, MainContent и Footer.
// 3.В Header компоненте разместите заголовок вашего сайта. Установите место для ThemeSwitcher в углу Header.
// 4.Добавьте в MainContent пару параграфов с заголовками, которые будут варьироваться в стилях в зависимости от темы.
// 5.В Footer поместите копирайт и любую другую полезную информацию, которую желаете добавить.
// 6.Реализуйте кнопку или переключатель для смены темы. Используйте useState для управления активной темой (light или dark).
// 7.Создайте объект или используйте CSS переменные для определения цветов и стилей двух тем — светлой и темной. Реализуйте функционал в ThemeSwitcher, который изменяет состояние темы в родительском компоненте (App) при нажатии на переключатель.
// 8.Передайте выбранную тему во все компоненты (Header, MainContent, Footer) через props.
// 9.В каждом компоненте используйте переданные props темы для определения стилей элементов (например, цвет текста, фона). Реализуйте изменение классов или стилей элементов на основании активной темы.
// 10.Добавьте необходимые CSS стили или модули для поддержки отображения светлой и темной темы. Убедитесь, что изменение темы динамично обновляет стили всех элементов.
// 11.Протестируйте приложение, переключая темы и наблюдая за корректным обновлением стилей всех компонентов. Проверьте реактивность интерфейса на разных устройствах и в различных браузерах.